{
    "blogs": {
        "welcome_blog": {
            "id": 1,
            "title": "Welcome to my blog",
            "desc": "I welcome you to my blog from the very bottom of my heart.",
            "content": "I welcome you to my blog from the very bottom of my heart. Content under development.",
            "date_created": "2025-03-01"
        },
        "what_is_programming": {
            "id": 2,
            "title": "What is programming?",
            "desc": "This post provides a great intro to programming for absolute beginners.",
            "content": "<strong>\"Programming is basically the process of giving proper instructions to a machine and making it perform a task.\"</strong><br><br><p>This was a very simple and surface definition for programming. Programming is not just about \"giving instructions\", there is an underlying meaning for it which we will discuss today in this blog. Many people confuse the terms \"coding\" and \"programming\" as the same thing. We will differentiate between these two terms and analyse how they are distinct. Then we will see the evolution of programming from the 1st Computer to the modern-day computer and how this evolution has made things easy for us. Then, we will list the most used programming languages in the world and discuss if you should learn them. Lastly, we will understand the applications of programming in the modern world.</p><br><br><hr class='styled-line'/><br><br><h2>The Real Meaning of Computer Programming</h2><br><p>In the preceding paragraph, we got a basic idea of programming through a simple definition. I mentioned that it was not the actual definition. We will understand the real definition by differentiating between coding and programming.<br><br> <b>Coding - It is the act of writing code in a specific programming language to instruct a machine. It is a subset of programming.</b> <br><br> <b>Programming - It involves analysing a problem, developing a solution algorithm, implementing the algorithm through code, debugging and improving the code and maintaining the code.</b> <br><br> In short, it is the complete software development cycle. Hence, we observe that programming is not just giving instructins, but more about problem analysis, algorithm formulation and evaluation.</p><br><br><hr class='styled-line'/><br><br><h2>Evolution of Computer Programming</h2><br><p>In general, there are two types of computer languages - Low-level languages and High-level languages. Low-level languages are called low-level because they are the real languages that a machine can comprehend. Binary Language [0, 1] is a low level language and the only language that computers understand. Early computers were directly fed code in binary a.k.a. machine language. Programming then shifted towards english-like codes. ASSEMBLY is the first computer language with english like words. Anyway, due to its complex and low level syntax, it was classified as low level language. With the passage of time, we shifted more towards english and came up with high-level languages like C/C++ and Java, which are widely used today. Howeven, in today's date, Python stands as the easiest & most user-friendly programming language. It is known for its easy syntax and its general-purpose nature. General- Purpose means that it can be used in various fields - Website Development, App Development, Game Development, Data Science, Artificial Intelligence, Graphics manipulation and a lot more. Slow processing is considered a demerit of Python. You can learn any language, but remember that problem analysis and algorithms are more important in programming.</p><br><br><hr class='styled-line'><br><br><h2>Applications and the Future of Programming</h2><br><p>Programming has wide ranging applications-from simple websites to rocket science. We can use programming to automate the traditional tasks done by humans manually. Automation is indeed one of the most fundamental principles of programming. We started by automating Calculations like 2+2, then we automated manual labour and now we can even automate thinking and decision making using AI. And the future? AI will be training AI itself! This leaves us to think the role of humans in an AI-driven society. Will AI affect humanity positively or negatively? We have no concrete answer to this question. All we can do is predict.</p><br><br><h2>Conclusion</h2><br><p>To conclude, I'll say that computer technology has drastically shaped the world. But for now, do not worry much about the future and focus on the present. Presently, computer programming is an in-demand skill that one should definitely go for. Programmers all around the world are working to reduce the effort in learning languages. Jensen Huang, the CEO of Nvidia says that english will be the new programming language to make coding more accessible. One fine day, I found a person on Youtube who said - \"People learn Python, not problem solving.\" Learn problem solving. Languages are only tools to express your solution. Focus on the application, not the tool, for that is what sets you away from the crowd.</p>","date_created": "2025-03-02"
        },
        "IITs_still_worth_it_?": {
            "id": 3,
            "title": "IITs: Are they still worth it?",
            "desc": "This post analyzes the pros and cons of IITs and why or why not should one go for them.",
            "content": "<p>The Indian Institutes of Technology are a network of educational and technological institutions in India which were established in 1950 by the Indian Government. The main purpose for their establishment was to enhance university education in India which would, in future, contribute to the development of India. IITs organize an extremely tough entrance examination, the Indian Institute of Technology Joint Entrance Examination (IIT-JEE) for admission to their undergraduate courses. For postgraduate courses, GATE examination is conducted. <b>About 12.58 Lakh</b> students appeared for JEE Main 2025, which gives us a clear indication of reputation of the IITs. In this post, we are going to talk about IITs, the IIT-JEE exam, and analyze their pros and cons. We will discuss about the reasons students go for IITs, why the exam is so tough, what happens after attending an IIT and what is the reservation quota in IITs.</p><br><br><br><h3>IIT-JEE: The entrance </h3><br><br><p>The IIT-JEE exam is conducted in two parts - JEE Main and JEE Advanced. JEE Advanced is considered the second toughest entrance examination in the world. Why so? The answer lies within the motive behind the establishment of IITs themselves. IITs attract the best brains of the nation. To filter out such talented and hard working people, IITs conduct such a tough exam. The result of this filtering can be seen in the college students which we will discuss later. Only those who have done hard work and shown consistency are able to get into these reputed institutes. Top reasons why students want to enter IITs: <br><br><b><ol><li>To secure a high paying job (generally abroad)</li><li>To get into research</li><li>To pursue their passion (in a tech field)</li><li>Students find a nice environment for entrepreneurial opportunities</li><li>To simply get world-class education - get access to the top-class facilities provided - Football fields, Cricket Fields, Swimming Pools, Libraries, etc.</li></ol></b><br><br>Hence, IITs become Institutes of National Importance for India (declared by Parliament).</p><br><br><h3>IITs: Reservation Quota</h3><p>Despite its reputation, reservation in IITs is quite harsh. Reservation is done to engage students from backward classes into world class education. Therefore in IITs, following is the latest reservation policy-<br><br><ul><li>SC: 15%</li><li>ST: 7.5%</li><li>OBC-NCL: 27%</li><li>EWS: 10%</li><li>PwD: 5% (internal reservations within each category)</li></ul><br><br>These reservations added to other reservations make upto 59.5% of the seats reserved. Now you can understand why I said that the policy, though meant for upliftment, is quite harsh. Low amount of seats are left for the General (Unreserved - UR) category. Although the purpose of this system is to admit people from all sections of the society - not all reservations are transparent. Some backward but rich (SCs/STs/OBCs/other) sections of the society find flaws in the reservation system and get reservation in an improper way and thus seats for the actually needy don't reach them.</p><br><br><h3>IITs: The Outcome</h3><br><br><p>We have discussed about IITs, the exam and the reservation. But what about the real question? Are IITs worth it? Have IITs achieved their actual motive? Let us make this clear in this section.</p>",
            "date_created": "2025-03-03"
        }
    }
}